app/Controllers/EquipmentAPI_Cotroller.php

SELECT *
FROM `equipments`
WHERE `price` BETWEEN 600 AND 3000
---
public function getEquipmentByPrice_API()
{
    $equipmentModel = new EquipmentModel();

    $startprice = "600";
    $endprice = "3000";

    // Apply the condition to the query
    $getprice = $equipmentModel->where("price BETWEEN $startprice AND $endprice")
                               ->findAll();