app/Controllers/Equipment.php

     public function view_all_equipments()
    {
        if(!session()->get('isLoggedIn'))
        return redirect()->to('/');
        $EquipmentModel = new EquipmentModel();

          // Get the search parameter
    $search = $this->request->getVar('search');

    // Apply filters if search parameter is present
    if ($search) {
        $EquipmentModel->like('id', $search)
                       ->orLike('title', $search)
                       ->orLike('serial_number', $search)
                       ->orLike('price', $search)
                       ->orLike('description', $search);
    }
//  pagination
    $data = [
        'equipment' => $EquipmentModel->paginate(3),
        'pager' => $EquipmentModel->pager,
        'search' => $search
    ];
---
SELECT *
FROM `equipments`
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `equipments`