app/Controllers/GetInTouch_API_Controller.php

INSERT INTO `get_in_touch` (`full_name`, `email`, `phone`, `message`) VALUES ('krushna', 'krushna@gmail.com', '776868767', 'test')
---
    public function GetInTouchFormAPI()
    {
        $getInTouchModel = new GetInTouchModel();

        $data = [
            'full_name' => $this->request->getVar('full_name'),
            'phone' => $this->request->getVar('phone'),
            'subject' => $this->request->getVar('subject'),
            'message' => $this->request->getVar('message')
        ];


        if ($getInTouchModel->insert($data)) {

SELECT *
FROM `get_in_touch`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `get_in_touch`
---
    public function view_all_website_leads()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/');
        }

        $getInTouchModel = new GetInTouchModel();


        $data = [
            'leads' => $getInTouchModel->paginate(10),  // pagination
            'pager' => $getInTouchModel->pager,
        ];