app/Controllers/LeadsAPI_Controller.php

SELECT *
FROM `property`
WHERE `property`.`id` = '7'
---
    public function getDetails()
    {
        $id = $this->request->getGet('id'); // Retrieve the 'id' from the query parameter

        if (!$id) {
            return $this->fail('No property ID provided.', 400); // Return an error if ID is missing
        }

        $PropertyModel = new PropertyModel();

        // Fetch the property by ID
        $property = $PropertyModel->find($id);