app/Controllers/LeadsAPI_Controller.php

SELECT *
FROM `equipments`
WHERE `eid` = '14'
 LIMIT 1
---
    public function getEquipmentDetails()
    {
        $eid = $this->request->getGet('eid'); // Retrieve the 'eid' from the query parameter

        if (!$eid) {
            return $this->fail('No Equipment ID provided.', 400); // Return an error if eid is missing
        }

        $EquipmentModel = new EquipmentModel();

        // Fetch the equipment by eid
        $equipment = $EquipmentModel->where('eid', $eid)->first();

SELECT *
FROM `leads`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `leads`
---
    public function view_all_leads()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/');
        }

        $leadsModel = new LeadsModel();

        // pagination
        $data = [
            'leads' => $leadsModel->paginate(10),
            'pager' => $leadsModel->pager,
        ];