app/Controllers/NewsLetter_API_Controller.php

SELECT *
FROM `newsletter`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `newsletter`
---
    public function view_all_newsletter_leads()
    {

        // echo 'testing';
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/');
        }

        $newsLetterModel = new NewsLetterModel();


        $data = [
            'leads' => $newsLetterModel->paginate(10),  // pagination
            'pager' => $newsLetterModel->pager,
        ];