app/Controllers/Property.php

SELECT *
FROM `property`
 LIMIT 3
SELECT COUNT(*) AS `numrows`
FROM `property`
---
public function view_all_property()
{
    if(!session()->get('isLoggedIn'))
    return redirect()->to('/');
    $PropertyModel = new PropertyModel();

     // Get the search parameter
     $search = $this->request->getVar('search');

     // Apply filters if search parameter is present
     if ($search) {
         $PropertyModel->like('id', $search)
                        ->orLike('name', $search)
                        ->orLike('state', $search)
                        ->orLike('city', $search)
                        ->orLike('zipcode', $search)
                        ->orLike('address', $search)
                        ->orLike('built_year', $search)
                        ->orLike('total_area', $search)
                        ->orLike('price', $search)
                        ->orLike('parking', $search);
     }

     $data = [
        'properties' => $PropertyModel->paginate(3),
        'pager' => $PropertyModel->pager,
         'search' => $search
     ];

SELECT *
FROM `property`
WHERE `property_image` LIKE '%1722246622_c97b52c263a59a7af388.png%'
 LIMIT 1
UPDATE `property` SET `property_image` = '1722246606_f2eb334721f1414a389c.png'
WHERE `property`.`id` IN ('7')
---
    public function delete_property_image()
   {
    $imageName = $this->request->getPost('image_name');

    $propertyModel = new PropertyModel();
    $property = $propertyModel->where('property_image LIKE', "%$imageName%")->first();

    if ($property) {
        $images = explode(',', $property['property_image']);
        $updatedImages = array_diff($images, [$imageName]);
        $newImageString = implode(',', $updatedImages);

        $propertyModel->update($property['id'], ['property_image' => $newImageString]);

SELECT *
FROM `states`
WHERE `id` IS NULL
 LIMIT 1
SELECT `cities`.`city` as `city_name`
FROM `cities`
JOIN `states` ON `cities`.`state_id` = `states`.`id`
WHERE `cities`.`id` IS NULL
 LIMIT 1
---
public function edit_property($id)
    {

        $StateModel = new StateModel();
        $CityModel = new CityModel();

        $stateId = $this->request->getPost('state');
        $cityId = $this->request->getPost('city');

        // Fetch state name
        $state = $StateModel->where('id', $stateId)->first();
        $stateName = $state['name'] ?? 'state not found.';

        // Fetch city name
        $city = $CityModel->select('cities.city as city_name')
                          ->join('states', 'cities.state_id = states.id')
                          ->where('cities.id', $cityId)
                          ->first();