app/Controllers/PropertyAPI_Cotroller.php

public function getProperty_types_and_Adress_API()
{
    $PropertyModel = new PropertyModel();
    $property = $PropertyModel->select('property_image,property_type, address,price,')
                              ->orderBy('pid', 'DESC')
                              ->findAll();
---
SELECT `property_image`, `property_type`, `address`, `price`
FROM `property`
ORDER BY `pid` DESC