app/Models/CityModel.php

    public function getCities() {
        return $this->db->table($this->table)->get()->getResultArray();
---
SELECT *
FROM `cities`