app/Models/EquipmentModel.php

SELECT *
FROM `equipments`
WHERE `id` = '1'
---
    public function get_equipment_by_id($id) {
        return $this->db
                        ->table('equipments')
                        ->where(["id" => $id])
                        ->get()
                        ->getRow();

SELECT *
FROM `equipments`
WHERE `eid` = '31'
---
    public function update_equipment_by_id($id, $data) {
        return $this->db
                    ->table('equipments')
                    ->where(["id" => $id])
                    ->set($data)
                    ->update();