app/Models/PropertyModel.php

SELECT *
FROM `property`
WHERE `id` = '2'
---
    public function get_property_by_id($id)
    {
        return $this->db
                        ->table('property')
                        ->where(["id" => $id])
                        ->get()
                        ->getRow();

UPDATE `property` SET `name` = 'newwwww', `description` = '<p>cafeteria not availabe</p>', `address` = 'ravet', `state` = 'state not found.', `city` = 'City not found.', `built_year` = '2023', `total_area` = '24 sqft', `zipcode` = '2023', `price` = '30000', `property_type` = 'Diagnostic Centers', `transaction_type` = 'Buy', `possession` = 'in 2 year', `parking` = 'Available', `pharmacy` = 'Available', `laboratory` = 'Available', `cafeteria` = 'Not Available'
WHERE `id` = '9'
---
    public function update_property_by_id($id, $data)
     {
        return $this->db
                    ->table('property')
                    ->where(["id" => $id])
                    ->set($data)
                    ->update();