app/Models/StateModel.php

    public function getStates() {
        return $this->db->table($this->table)->get()->getResultArray();
---
SELECT *
FROM `states`